package com.xmm.firstcode;

public class 软装{
    /*


    全屋：窗帘 灯具 开关
    厨房：
    1：油烟机 灶台（方太 3800 ）
    地址1：弋江区瑞丰商博城L区1栋124
          安徽省芜湖市弋江区瑞丰商博城L区1栋124
    天猫：
        方太EMD20A.M+TH31B  3999 报价 3650一般便宜300
        方太EMD20A.M+HC8BE  4199
        方太EMD20A.M+TH28B  4399
    2：热水器 2398+安装费+配件费（线下安装师傅拿）
        指标
        ①：功率：能效等级：一级能效
        ②：安全性能
        ③：容量：13L~16L（大花洒）
        ④：类别：冷凝式>恒温式>强排式
        如果是出租房使用、过渡期使用、或者是追求性价比和简单好用，建议选择美的、海尔，万家乐；
        如果是追求更好的质量、更好的技术和性能体验，建议选择能率，林内，万和；
        如果是豪宅，建议选择百乐满、能率。
        林内和能效芜湖店不多，售后可能有问题。
        选万和的：https://item.jd.com/100007370977.html
    3：净水器
        选择1：美的 瑞丰商博城L区 https://item.jd.com/100004685505.html 1898
        选择2：小米 https://item.jd.com/100009776714.html
        指标
        ①：2到3年更换滤芯
        ②：水处理量（加仑）：1000加仓 大概是1000*3.8L就要换滤芯了
        ③：滤芯：反渗透膜或者精密活性炭
        ④：水质处理方式：软化法、蒸馏法、煮沸法、磁化法、矿化法、臭氧杀菌、活性炭吸附等。其中，活性炭吸附效果最佳。
        ⑤：有无双膜保护设计：
        ⑥：废水比一般1:3 现在1:1
    4：水槽 1200
        选择：欧琳（瑞丰商博城B区13栋124-125号）或者九牧（马仁山东路瑞丰商博城K区5栋111-114号）
        指标
        ①：单槽 台中盆
        ②：厚度：1.0mm以上的
        ③：深度： 20cm-23cm
        ④：水龙头：抽拉式
        ⑤：下水管材质：pvc材质
        ⑥：留一个净水器的孔
    5：冰箱（3000~3500）
        选 三门冰箱（双十一 京东排行。海尔 西门子 美的 容声 美菱 三星 tcl 奥马 松下 康佳）
        制冷方式：直冷（会结冰）、风冷（推荐）、风直冷（混冷）
        循环系统：多循环＞双循环＞单循环。从性价比来说：双循环最好。（需要是独立双循环系统。不然可能是1个蒸发器+2个风机也说双系统）
        压缩机类型：定频和变频
        噪音:国家标准规定噪音小于45分贝。一般要在38-40分贝之间
        容量：最低平均容积50升/人
    卫生间：九牧专卖店（芜湖市弋江区瑞丰商博城L区2幢115号）
    1：花洒
    选择：https://item.jd.com/10672982773.html#none  1000~1300
         https://item.jd.com/4067438.html#crumb-wrap
    形式分类：手持花洒 顶喷花洒 侧喷花洒:
    出水方式分类：气泡式出水 按摩式出水 喷雾式出水
    指标
    ①：看外表镀层
    ②：阀芯
    ③：出水方式
    ④：是否容易清洁

    2：马桶
    3：洗脸盆
    4：镜子
    客厅：
    1:电视
    买小米或者华为的 618销量高的（3000）
    2:沙发
    3:电视桌
    4:饭桌和椅子
    卧室：
    床
    阳台：
    1：洗衣机 海尔的 3000
     */





}