package com.example.algorithmdemo;

public class Explain {
    /*
    20201019:给定 S 和 T 两个字符串，当它们分别被输入到空白的文本编辑器后，判断二者是否相等，并返回结果。 # 代表退格字符。
    20201020(重排链表):给定一个单链表 L：L0→L1→…→Ln-1→Ln ，
             将其重新排列后变为： L0→Ln→L1→Ln-1→L2→Ln-2→…
             你不能只是单纯的改变节点内部的值，而是需要实际的进行节点交换。
    20201021：925. 长按键入。利用双指针
    20201022：划分字母区间 (https://leetcode-cn.com/problems/partition-labels/)
    20201023：234. 回文链表（https://leetcode-cn.com/problems/palindrome-linked-list/）
    20201028：1207. 独一无二的出现次数
    20201029：129. 求根到叶子节点数字之和
    20201030：463. 岛屿的周长
    20201102：349. 两个数组的交集
    20201103：941. 有效的山脉数组
    20201104：57. 插入区间（困难）
    20201105：127. 单词接龙（中等）
    20201106：127. 单词接龙（中等）
    20201110：31. 下一个排序
    20201111：514. 自由之路
    20201112：922. 按奇偶排序数组 II
    20201113：328. 奇偶链表
    20201114：1122. 数组的相对排序
    20201115：402. 移掉K位数字( copy答案)
    20201116： 406. 根据身高重建队列( copy答案)
    20201117： 1030. 距离顺序排列矩阵单元格( copy答案)
    20201117： 134. 加油站
    20201118： 147. 对链表进行插入排序
    20201119：134. 加油站
    20201120： 147. 对链表进行插入排序
    20201122：  242. 有效的字母异位词
    20201123： 452. 用最少数量的箭引爆气球
    20201124：222. 完全二叉树的节点个数
    20201125：1370. 上升下降字符串
    20201126：164. 最大间距
    20201201：34. 在排序数组中查找元素的第一个和最后一个位置
    20201202：321. 拼接最大数(copy答案)
    20201202：204. 计数质数
    20201206：118. 杨辉三角
    20201207：861. 翻转矩阵后的得分(copy答案)
    20201208：842. 将数组拆分成斐波那契序列(copy答案)
    20201208：62. 不同路径
    20201214：* 柠檬水找零
     */
}
